artillery.yml
config:
  target: "http://localhost:3000"
  phases: 
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            lastName: "TestTeacher"
            email: "{{ $randomString() }}"
            password: "Password123"
            role: "teacher"
      - get:
          url: "/users/teachers"